#include <stdio.h>         // 표준입출력함수 라이브러리 헤더파일을 포함한다.
#define IN "원의 반지름은 100입니다. \n" 
/* 매크로 이름은 IN은 일반 변수와 구별하기 위해 대문자로 적고, 
   매크로는 선행처리기 #define을 통해 단순 치환되는 자료이다. */
#define PI 3.1415926535    // PI라는 매크로의 값, 매크로 정의문 끝에 세미콜론(;)을 사용하지 않는다.
#define AREA(X) (PI*(X)*(X)) // #define 매크로명(인수, 인수) (수식)의 대표적인 예시
#define OUT printf("원의 면적을 구하고 프로그램을 종료합니다. \n")
// 매크로 OUT을 실행하면 “원의 면적을 구하고~” 라는 메시지를 화면에 표시한다.
void main(){
	printf("%s \n", IN); // string 형식으로 매크로 IN을 화면에 표시
	printf("원의 면적은 %10.5f입니다. \n\n", AREA(100));  
        /* %10.5 가 아니라 %10.5에 f를 붙이는 것은 오차를 줄인다. 
          매크로 AREA에 100을 넣어 값을 구하여 화면에 표시한다. */ 
	OUT;
        // 선행처리기가 정의한 대로 OUT을 실행하여 메시지를 화면에 표시한다.
}
